book_collection/app/controllers/books_controller.rb

  def create
    @book=Book.new(book_params)

    if @book.save
---
INSERT INTO `books` (`title`, `genre`, `author`, `created_at`, `updated_at`) VALUES ('Book2', 'Mystery', 'Author2', '2020-09-07 20:59:00', '2020-09-07 20:59:33')

  def update
     @book=Book.find(params[:id])

    if @book.update_attributes(book_params)
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
UPDATE `books` SET `genre` = 'Fantasy', `created_at` = '2020-09-07 16:48:00', `updated_at` = '2020-09-07 21:07:02' WHERE `books`.`id` = 1

  def delete
    @book=Book.find(params[:id])
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 2 LIMIT 1